//! Метод forEach
//TODO Метод перебирання масиву, який використовується для заміни циклів for і for...of в роботі з колекцією даних.
//? Особливості:
//  - Поелементо перебирає масив.
//  - Викликає колбек-функцію для кожного елемента масиву.
//  - Нічого не повертає.

// массив.forEach(function callback(element, index, array) {
//   // Тіло колбек-функції
// });

// Аргументи колбек - функції - це значення поточного елемента element, його індекс index і власне вихідний масив array.
// Можна оголошувати тільки необхідні параметри, найчастіше - це елемент, головне не забувати про їх порядок.

const numbers = [5, 10, 15, 20, 25];

// Класичний for
for (let i = 0; i < numbers.length; i += 1) {
  console.log(`Індекс ${i}, значення ${numbers[i]}`);
}

// Метод перебирання forEach
numbers.forEach(function (number, index) {
  console.log(`Індекс ${index}, значення ${number}`);
});

//! Єдиним випадком, коли варто використовувати цикли for або for...of для перебирання масиву, - це задачі з перериванням виконання циклу.
//! Перервати виконання методу forEach не можна, він завжди перебирає масив до кінця. 