//! Чисті функції

//TODO Функція з побічними ефектами - це функція, яка в процесі виконання може змінювати або використовувати глобальні змінні,
//TODO змінювати значення аргументів посилального типу, виконувати операції введення - виведення тощо.

const dirtyMultiply = (array, value) => {
  for (let i = 0; i < array.length; i += 1) {
    array[i] = array[i] * value;
  }
};

const numbers1 = [1, 2, 3, 4, 5];
dirtyMultiply(numbers1, 2);
// Відбулася мутація вихідних даних - масиву numbers
console.log(numbers1); // [2, 4, 6, 8, 10]

//* Функція dirtyMultiply(array, value) множить кожен елемент масиву array на число value. Вона змінює (мутує) вихідний масив за посиланням.

//TODO Чиста функція(pure function) - це функція, результат якої залежить тільки від значень переданих аргументів.
//TODO За умови однакових аргументів вона завжди повертає один і той самий результат і не має побічних ефектів, тобто не змінює значення аргументів.

//* Напишемо реалізацію чистої функції множення елементів масиву, що повертає новий масив, не змінюючи вихідний.

const pureMultiply = (array, value) => {
  const newArray = [];

  array.forEach(element => {
    newArray.push(element * value);
  });

  return newArray;
};

const numbers = [1, 2, 3, 4, 5];
const doubledNumbers = pureMultiply(numbers, 2);

// Мутація вихідних даних не відбулася
console.log(numbers); // [1, 2, 3, 4, 5]
// Функція повернула новий масив зі зміненими даними
console.log(doubledNumbers); // [2, 4, 6, 8, 10]